;******************************************************************************
;* PRU C/C++ Codegen                                              Unix v2.2.1 *
;* Date/Time created: Wed Aug 22 17:59:33 2018                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("src/beagle-pru/forthwith-pru.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.2.1 Copyright (c) 2012-2017 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/elcritch/projects/nervsy/sm/forthwith")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/home/elcritch/.nerves/artifacts/toolchain_extras_pru_cgt-linux_x86_64-3.0.1/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$46)

$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$49)

$C$DW$4	.dwtag  DW_TAG_formal_parameter

	.dwattr $C$DW$T$125, DW_AT_byte_size(0x50)
$C$DW$636	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$636, DW_AT_upper_bound(0x13)

	.dwendtag $C$DW$T$125


$C$DW$T$126	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$126, DW_AT_byte_size(0x4c)
$C$DW$637	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$637, DW_AT_upper_bound(0x12)

	.dwendtag $C$DW$T$126


$C$DW$T$127	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x2c)
$C$DW$638	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$638, DW_AT_upper_bound(0x0a)

	.dwendtag $C$DW$T$127


$C$DW$T$128	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_byte_size(0x08)
$C$DW$639	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$639, DW_AT_upper_bound(0x01)

	.dwendtag $C$DW$T$128

$C$DW$T$129	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$24)


$C$DW$T$130	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x10)
$C$DW$640	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$640, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$130


$C$DW$T$131	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$131, DW_AT_byte_size(0x28)
$C$DW$641	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$641, DW_AT_upper_bound(0x09)

	.dwendtag $C$DW$T$131


$C$DW$T$132	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$132, DW_AT_byte_size(0x30)
$C$DW$642	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$642, DW_AT_upper_bound(0x0b)

	.dwendtag $C$DW$T$132


$C$DW$T$133	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_byte_size(0x50)
$C$DW$643	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$643, DW_AT_upper_bound(0x13)

	.dwendtag $C$DW$T$133


$C$DW$T$134	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$134, DW_AT_byte_size(0x4c)
$C$DW$644	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$644, DW_AT_upper_bound(0x12)

	.dwendtag $C$DW$T$134


$C$DW$T$135	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$135, DW_AT_byte_size(0x2c)
$C$DW$645	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$645, DW_AT_upper_bound(0x0a)

	.dwendtag $C$DW$T$135

$C$DW$T$139	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$22)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)

$C$DW$T$50	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$50, DW_AT_name("size_t")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$50, DW_AT_decl_file("/home/elcritch/.nerves/artifacts/toolchain_extras_pru_cgt-linux_x86_64-3.0.1/include/stddef.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x19)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x04)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x04)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

$C$DW$T$110	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$110, DW_AT_address_class(0x20)

$C$DW$T$140	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$110)

$C$DW$T$142	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$28)

$C$DW$T$143	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$6)


$C$DW$T$144	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$144, DW_AT_byte_size(0x11)
$C$DW$646	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$646, DW_AT_upper_bound(0x10)

	.dwendtag $C$DW$T$144

$C$DW$T$145	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$145, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$145, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$145, DW_AT_byte_size(0x01)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("forth_word")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$647, DW_AT_name("prev")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("prev")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x67)
	.dwattr $C$DW$647, DW_AT_decl_column(0x0c)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$648, DW_AT_name("body")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("body")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x68)
	.dwattr $C$DW$648, DW_AT_decl_column(0x0d)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$649, DW_AT_name("meta")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("meta")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x69)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0b)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$650, DW_AT_name("len")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$650, DW_AT_decl_column(0x0b)

$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$651, DW_AT_name("name")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$651, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$29, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$29

$C$DW$T$19	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$19, DW_AT_name("fword_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x1b)

$C$DW$T$20	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_address_class(0x20)

$C$DW$T$160	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$20)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_name("forthwith_context")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x1c)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$652, DW_AT_name("regs")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("regs")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x52)
	.dwattr $C$DW$652, DW_AT_decl_column(0x12)

$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$653, DW_AT_name("vars")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("vars")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x53)
	.dwattr $C$DW$653, DW_AT_decl_column(0x12)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$654, DW_AT_name("psp")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("psp")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x54)
	.dwattr $C$DW$654, DW_AT_decl_column(0x13)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$655, DW_AT_name("rsp")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("rsp")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x55)
	.dwattr $C$DW$655, DW_AT_decl_column(0x13)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$656, DW_AT_name("user")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("user")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x56)
	.dwattr $C$DW$656, DW_AT_decl_column(0x13)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$657, DW_AT_name("dict")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("dict")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x57)
	.dwattr $C$DW$657, DW_AT_decl_column(0x18)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$658, DW_AT_name("strings")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("strings")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x58)
	.dwattr $C$DW$658, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$40, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$40

$C$DW$T$163	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$163, DW_AT_name("fw_ctx_t")
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$163, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x03)

$C$DW$T$164	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
	.dwattr $C$DW$T$164, DW_AT_address_class(0x20)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("forthwith_dict_stack")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$659, DW_AT_name("head")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("head")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x46)
	.dwattr $C$DW$659, DW_AT_decl_column(0x0c)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$660, DW_AT_name("base")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x47)
	.dwattr $C$DW$660, DW_AT_decl_column(0x0c)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$661, DW_AT_name("size")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x48)
	.dwattr $C$DW$661, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$41, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$41

$C$DW$T$36	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$36, DW_AT_name("fw_ctx_dict_stack_t")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x03)

$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_name("forthwith_regs")
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$662, DW_AT_name("w")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("w")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x29)
	.dwattr $C$DW$662, DW_AT_decl_column(0x0b)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$663, DW_AT_name("x")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$663, DW_AT_decl_column(0x0b)

$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$664, DW_AT_name("ip")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("ip")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$664, DW_AT_decl_column(0x0b)

$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$665, DW_AT_name("tos")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("tos")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$665, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$42, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$42

$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("fw_ctx_regs_t")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)

$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("forthwith_stack")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$666, DW_AT_name("head")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("head")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x40)
	.dwattr $C$DW$666, DW_AT_decl_column(0x0c)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$667, DW_AT_name("base")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x41)
	.dwattr $C$DW$667, DW_AT_decl_column(0x0c)

$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$668, DW_AT_name("size")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x42)
	.dwattr $C$DW$668, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$43, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$43

$C$DW$T$34	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$34, DW_AT_name("fw_ctx_stack_t")
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$34, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x03)

$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_name("forthwith_str_stack")
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x0c)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$669, DW_AT_name("head")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("head")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$669, DW_AT_decl_column(0x09)

$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$670, DW_AT_name("base")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$670, DW_AT_decl_column(0x09)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$671, DW_AT_name("size")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$671, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$44, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$44

$C$DW$T$38	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$38, DW_AT_name("fw_ctx_str_stack_t")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)

$C$DW$T$39	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_address_class(0x20)


$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("forthwith_vars")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x20)
$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$672, DW_AT_name("state")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x33)
	.dwattr $C$DW$672, DW_AT_decl_column(0x0b)

$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$673, DW_AT_name("error")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("error")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x34)
	.dwattr $C$DW$673, DW_AT_decl_column(0x0b)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$674, DW_AT_name("tib_idx")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("tib_idx")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x36)
	.dwattr $C$DW$674, DW_AT_decl_column(0x0b)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$675, DW_AT_name("tib_len")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("tib_len")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x37)
	.dwattr $C$DW$675, DW_AT_decl_column(0x0b)

$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$676, DW_AT_name("tib_str")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("tib_str")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0x38)
	.dwattr $C$DW$676, DW_AT_decl_column(0x0b)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$677, DW_AT_name("tob_idx")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("tob_idx")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$677, DW_AT_decl_column(0x0b)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$678, DW_AT_name("tob_len")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("tob_len")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$678, DW_AT_decl_column(0x0b)

$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$679, DW_AT_name("tob_str")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("tob_str")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$679, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$45, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$45

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("fw_ctx_vars_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_decl_file("src/forthwith.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x03)

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x20)

	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 14
	.dwcfi	cfa_register, 8
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 16
	.dwcfi	same_value, 17
	.dwcfi	same_value, 18
	.dwcfi	same_value, 19
	.dwcfi	same_value, 20
	.dwcfi	same_value, 21
	.dwcfi	same_value, 22
	.dwcfi	same_value, 23
	.dwcfi	same_value, 24
	.dwcfi	same_value, 25
	.dwcfi	same_value, 26
	.dwcfi	same_value, 27
	.dwcfi	same_value, 28
	.dwcfi	same_value, 29
	.dwcfi	same_value, 30
	.dwcfi	same_value, 31
	.dwcfi	same_value, 32
	.dwcfi	same_value, 33
	.dwcfi	same_value, 34
	.dwcfi	same_value, 35
	.dwcfi	same_value, 36
	.dwcfi	same_value, 37
	.dwcfi	same_value, 38
	.dwcfi	same_value, 39
	.dwcfi	same_value, 40
	.dwcfi	same_value, 41
	.dwcfi	same_value, 42
	.dwcfi	same_value, 43
	.dwcfi	same_value, 44
	.dwcfi	same_value, 45
	.dwcfi	same_value, 46
	.dwcfi	same_value, 47
	.dwcfi	same_value, 48
	.dwcfi	same_value, 49
	.dwcfi	same_value, 50
	.dwcfi	same_value, 51
	.dwcfi	same_value, 52
	.dwcfi	same_value, 53
	.dwcfi	same_value, 54
	.dwcfi	same_value, 55
	.dwendentry

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

$C$DW$680	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$680, DW_AT_name("R0_b0")
	.dwattr $C$DW$680, DW_AT_location[DW_OP_reg0]

$C$DW$681	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$681, DW_AT_name("R0_b1")
	.dwattr $C$DW$681, DW_AT_location[DW_OP_reg1]

$C$DW$682	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$682, DW_AT_name("R0_b2")
	.dwattr $C$DW$682, DW_AT_location[DW_OP_reg2]

$C$DW$683	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$683, DW_AT_name("R0_b3")
	.dwattr $C$DW$683, DW_AT_location[DW_OP_reg3]

$C$DW$684	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$684, DW_AT_name("R1_b0")
	.dwattr $C$DW$684, DW_AT_location[DW_OP_reg4]

$C$DW$685	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$685, DW_AT_name("R1_b1")
	.dwattr $C$DW$685, DW_AT_location[DW_OP_reg5]

$C$DW$686	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$686, DW_AT_name("R1_b2")
	.dwattr $C$DW$686, DW_AT_location[DW_OP_reg6]

$C$DW$687	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$687, DW_AT_name("R1_b3")
	.dwattr $C$DW$687, DW_AT_location[DW_OP_reg7]

$C$DW$688	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$688, DW_AT_name("R2_b0")
	.dwattr $C$DW$688, DW_AT_location[DW_OP_reg8]

$C$DW$689	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$689, DW_AT_name("R2_b1")
	.dwattr $C$DW$689, DW_AT_location[DW_OP_reg9]

$C$DW$690	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$690, DW_AT_name("R2_b2")
	.dwattr $C$DW$690, DW_AT_location[DW_OP_reg10]

$C$DW$691	.dwtag  DW_TAG_TI_assign_register
	.dwattr $C$DW$691, DW_AT_name("R2_b3")
	.dwattr $C$DW$691, DW_AT_location[DW_OP_reg11]

